# Starting the Pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
# getting the data into series format
data1 = pd.Series(34)

In [4]:
data1

0    34
dtype: int64

In [5]:
type(data1)

pandas.core.series.Series

In [6]:
data2 = pd.Series([4,1,2,6,5,7])

In [8]:
data2

0    4
1    1
2    2
3    6
4    5
5    7
dtype: int64

In [9]:
# converting a numpy array into the series

# Getting the series from both the data structures....
list1 = [4,1,6,5,7,8,3]

# creating a numpy array from the list
np_array1 = np.array(list1)

data3 = pd.Series(np_array1)

In [10]:
data3

0    4
1    1
2    6
3    5
4    7
5    8
6    3
dtype: int32

In [11]:
data3 = pd.Series(["delhi","mumbai","pune"],index = ['a','v','s'])

In [13]:
data3

a     delhi
v    mumbai
s      pune
dtype: object

In [14]:
len(data3)

3

In [15]:
# Series data can be accessed using the index values
data3['s']

'pune'

In [16]:
data3[2]

'pune'

In [17]:
# another way of creating the pandas series is by passing the 
 # data in the form of dictionary
    # Do it!!!!!
data4 = pd.Series({'a':'haha','b':'bye','c':'data'})

In [19]:
data4

a    haha
b     bye
c    data
dtype: object

In [20]:
# Now, we will be adding a value called as nan i.e.
 # not a number
data5 = pd.Series([4,1,5,6,4,5,5,7,np.nan])

In [22]:
data5

0    4.0
1    1.0
2    5.0
3    6.0
4    4.0
5    5.0
6    5.0
7    7.0
8    NaN
dtype: float64

In [23]:
# length and size will give same result here
len(data5)

9

In [24]:
data5.shape

(9,)

In [25]:
data5.size

9

In [26]:
# we are getting one less number of data as nan is not a countable
 # data hence 9 - 1 = 8
data5.count()

8

In [27]:
# sometimes we need to get the unique values from the columns 
 # of the dataframe
    
data5.unique()

array([ 4.,  1.,  5.,  6.,  7., nan])

In [28]:
# This will tell the unique numbers as well as their frequencies
data5.value_counts()

5.0    3
4.0    2
7.0    1
6.0    1
1.0    1
dtype: int64

In [29]:
data6 = pd.Series([4,1,5,3,7], index = ['d','a','h','s','e'])

In [30]:
# accessing the data using the index value which is given by us
data6['h']

5

In [31]:
# we can access the data using internal index also which is taken 
 # care by python
data6[2]

5

In [32]:
# getting the index of the Series
data6.index

Index(['d', 'a', 'h', 's', 'e'], dtype='object')

In [33]:
# for getting the values associated with the series
data6.values

array([4, 1, 5, 3, 7], dtype=int64)

In [34]:
# getting the top 5 data
data5.head()

# we can get fix number of data by passing a number in head(4)

0    4.0
1    1.0
2    5.0
3    6.0
4    4.0
dtype: float64

In [35]:
# getting the bottom data
data5.tail()

4    4.0
5    5.0
6    5.0
7    7.0
8    NaN
dtype: float64

In [36]:
data6

d    4
a    1
h    5
s    3
e    7
dtype: int64

In [37]:
# accessing multiple data using rows using multiple index
data6[['a','e']]

a    1
e    7
dtype: int64

In [32]:
# take function will take internal list of index
# here we have given a list of atomic element
# It will return the index as well as value of the passed 
 # index list
data6.take([3])

s    3
dtype: int64

### Using loc and iloc

In [38]:
# defining the data using pd
salary1 = pd.Series([30000,24000,34000,28000],index = [4,1,5,7])

In [39]:
# loc means location, which is a better way of accessing the data
 # with the index given by us 
# It is better to access the data using the loc function for object
 # of type pandas
# This is better in case of index in numbers because in case of 
 # index as character there is no confusion.
salary1.loc[7]

28000

## 28-06-2019

In [35]:
# iloc function for retrieving the data
salary1.loc[7]

28000

In [40]:
# loc will retrieve the data on the basis of given index as per us
# iloc will retieve the data on the basis of internal index
salary1.iloc[3]

28000

In [37]:
# incase of loc pandas will return NaN for those index which 
 # do not exists
# But, in case of iloc pandas will give error for index which do
 #not exists

In [41]:
# Crete two pandas series and perform mathematical operations
pd_series1 = pd.Series([3,1,6,5,7])
pd_series2 = pd.Series([5,7,1,3,2])

In [42]:
pd_series1 + pd_series2

0    8
1    8
2    7
3    8
4    9
dtype: int64

In [43]:
# we can give the index later also
pd_series3 = pd.Series([5,1,2,7,6,8])

In [44]:
pd_series3

0    5
1    1
2    2
3    7
4    6
5    8
dtype: int64

In [45]:
# giving the index value for these
pd_series3.index = ['a','b','c','d','e','f']

In [46]:
pd_series3

a    5
b    1
c    2
d    7
e    6
f    8
dtype: int64

In [47]:
# values can be reassingned also to the pandas series using index
pd_series3['c']= 456

In [48]:
pd_series3

a      5
b      1
c    456
d      7
e      6
f      8
dtype: int64

In [49]:
# slicing can also be done in pandas series
pd_series3[0:4]

a      5
b      1
c    456
d      7
dtype: int64

In [46]:
# we are decreasing the index starting from end till beginning
pd_series3[5::-2]

f    8
d    7
b    1
dtype: int64

In [47]:
# we can give the range in our assigned index also
pd_series3['a':'d']

a      5
b      1
c    456
d      7
dtype: int64

## Dataframes

In [50]:
# Introduction to the dataframes
# A data frame is the logical representation of the tables in the 
 # programming lanugage
# Dataframes concept comes from R programming language and is now
 # used in languages like R, python, scala, julia
names = pd.Series(['bhavi','vishal','avni','ritu'],index = [1001,
                                                           1002,
                                                           1003,
                                                           1004])

In [51]:
# names is a pandas series here, we can check it using the type
 # function
type(names)

pandas.core.series.Series

In [53]:
# converting the series into the pandas dataframe
names_df1 = pd.DataFrame({'student':names})

In [54]:
# This dataframe is the table representation of the pandas series
names_df1

     student
1001   bhavi
1002  vishal
1003    avni
1004    ritu

In [57]:
# Task, Now define a dataframe which have columns like names, marks,
 # area of interest
my_names = pd.Series(['avni','vikas','nishant','asmita'])
my_aoi = pd.Series(['computers','politics','arts','psychology'])
my_marks = pd.Series([89,87,78,76])

In [58]:
my_student_df1 = pd.DataFrame({'names':my_names,'AOI':my_aoi,
                              'marks':my_marks})

In [63]:
my_student_df1

     names         AOI  marks
0     avni   computers     89
1    vikas    politics     87
2  nishant        arts     78
3   asmita  psychology     76

In [64]:
# get the shape and size of the dataframe
my_student_df1.shape

(4, 3)

In [65]:
my_student_df1.size

12

In [66]:
len(my_student_df1)

4

In [67]:
# getting the columns of the dataframe
# means, this will print the names of the columns of a 
 # dataframe
my_student_df1.columns

Index(['names', 'AOI', 'marks'], dtype='object')

In [68]:
# Task is to reassign the column names
my_student_df1.columns = ['a','b','c']

In [69]:
my_student_df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [70]:
my_student_df1

         a           b   c
0     avni   computers  89
1    vikas    politics  87
2  nishant        arts  78
3   asmita  psychology  76

In [71]:
# task is to reassign new index values
my_student_df1.index = ['x','y','z','i']

In [72]:
# Task : 1
# define a pandas series and also define the index in it
# define two more pandas series without index
# Now, create the dataframe out of those 3 pandas series and check
 # what index values the whole dataframe will take???

In [73]:
my_student_df1.columns

Index(['a', 'b', 'c'], dtype='object')

In [74]:
my_student_df1

         a           b   c
x     avni   computers  89
y    vikas    politics  87
z  nishant        arts  78
i   asmita  psychology  76

In [75]:
# accesing a particular column data from a dataframe
# loc and iloc will also work on the dataframes
# But, loc and iloc will give the row data 
# Below syntax will give the column data
my_student_df1['b']

x     computers
y      politics
z          arts
i    psychology
Name: b, dtype: object

In [66]:
# accessing the multiple columns of the dataframe at once 
 # that too only printing first 2 rows  ??

# numpy and pandas are the tool of the data analysis and data
 # cleaning. And, out of 100 data science 70% time is spent in 
    # data pre processing.....

# If you are good at numpy and pandas then working with algos will 
 # easy.
my_student_df1

         a           b   c
x     avni   computers  89
y    vikas    politics  87
z  nishant        arts  78
i   asmita  psychology  76

In [76]:
 my_student_df1[['a','b']].head(2)

       a          b
x   avni  computers
y  vikas   politics

In [77]:
# for below 2 rows of my_student_df1
my_student_df1[['a','b']].tail(2)

         a           b
z  nishant        arts
i   asmita  psychology

In [78]:
# TASK
# Now, we want specific columns as well as specific rows?

In [79]:
# for accessing the specific columns data with specific rows
my_student_df1[['a','b']].loc[['x','z']]

         a          b
x     avni  computers
z  nishant       arts

In [80]:
# another way of doing the same is 
my_student_df1[['a','b']].take([1,3])

        a           b
y   vikas    politics
i  asmita  psychology

In [81]:
# Even if we extract some specific part from a dataframe, then that
 # specific part is also a dataframe
type(my_student_df1[['a','b']].take([1,3]))

pandas.core.frame.DataFrame

In [82]:
# TASK
# get me the location of a specific column?
my_student_df1.columns.get_loc('b')

1

In [83]:
# Applying the condition on dataframe
# c is the column name here in our dataframe
my_student_df1.c < 80

x    False
y    False
z     True
i     True
Name: c, dtype: bool

In [75]:
# we can accessed cell of a dataframe using loc, iloc and take 
 # function, but there are other ways also to do that

# here 'x' is row and 'a' is column. It's a same kind of access
 # as we did in matrix
my_student_df1.at['x','a']

'avni'

In [84]:
# we can access a cell with natural index also
my_student_df1.iat[2,1]

'arts'

In [85]:
# 5 min break
my_student_df1

         a           b   c
x     avni   computers  89
y    vikas    politics  87
z  nishant        arts  78
i   asmita  psychology  76

In [90]:
# renaming the column of a datafame but in a new dataframe
my_student_df1_new = my_student_df1.rename(columns={'a':'new_a'})

In [91]:
my_student_df1_new

     new_a           b   c
x     avni   computers  89
y    vikas    politics  87
z  nishant        arts  78
i   asmita  psychology  76

In [92]:
# changing the original column also
my_student_df1.rename(columns={'a':'new_a'}, inplace=True)

In [93]:
my_student_df1

     new_a           b   c
x     avni   computers  89
y    vikas    politics  87
z  nishant        arts  78
i   asmita  psychology  76

### TASK
#### add another column into the existing dataframe?

#### In, the lunch time please download a .csv demo file from internet 

#### Anyone downloaded any cvs file ?
#### Most of the time you will get data from some sources 
 #### it could be sqoop, flume or some other direct source
#### A data analyst or data scientist will be working on that data and 
 #### that data is ever growing called as big data
#### So, we will be working on that file and our file is of csv format

In [82]:
# checking where we are present at the moment

In [83]:
pwd()

'G:\\Data_Science\\My_KOENIG_Material\\Machine Learning (Data Science) with Python\\Chapter_1'

In [84]:
cd D:\Programming\PYTHON\My_ML\my_ml_scripts

[WinError 3] The system cannot find the path specified: 'D:\\Programming\\PYTHON\\My_ML\\my_ml_scripts'
G:\Data_Science\My_KOENIG_Material\Machine Learning (Data Science) with Python\Chapter_1

In [94]:
# reading the csv file which is IRIS.csv in our present location
import pandas as pd
import numpy as np

my_iris = pd.read_csv("IRIS.csv")

In [95]:
# This proves that whatever the file we are reading through pandas
 # it will eventually get converted to the logical object called 
    # as dataframe. Now, we can perform any data manipulation on the 
     # dataframe
type(my_iris)

pandas.core.frame.DataFrame

In [87]:
# getting the top 5 data from the dataframe that is achieved by 
 # loading the IRIS.csv file
my_iris.head(6)

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa

In [96]:
my_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [97]:
my_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [98]:
# getting the maximum value of the sepal_length from the column
max(my_iris.sepal_length)

7.9

In [91]:
# TASK
# calculate the standard deviation for the column petal_width
# question is what is standard deviation?
# what is variance ?
# what is mean ?
# class over for today....

In [99]:
# accessing a particular column from the dataframe
my_iris['sepal_length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [100]:
# accessing the data using the dot operator
my_iris.sepal_length.head(5)

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64

In [101]:
# getting the mean of the sepal_length
np.mean(my_iris.sepal_length)

5.843333333333335

In [102]:
# getting the standard deviation of spela_length
np.std(my_iris.sepal_length)

0.8253012917851409

In [103]:
my_iris.sepal_length > 5.8

0      False
1      False
2      False
3      False
4      False
       ...
145     True
146     True
147     True
148     True
149     True
Name: sepal_length, Length: 150, dtype: bool

In [104]:
# getting all the index of dataframe where condition is satisfied
my_iris.index[my_iris.sepal_length > 5.8]

Int64Index([ 50,  51,  52,  54,  56,  58,  61,  62,  63,  65,  68,  70,  71,
             72,  73,  74,  75,  76,  77,  78,  83,  85,  86,  87,  91,  97,
            100, 102, 103, 104, 105, 107, 108, 109, 110, 111, 112, 115, 116,
            117, 118, 119, 120, 122, 123, 124, 125, 126, 127, 128, 129, 130,
            131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 143, 144,
            145, 146, 147, 148, 149],
           dtype='int64')

In [105]:
desired_index = list(my_iris.index[my_iris.sepal_length > 5.8])

In [106]:
type(desired_index)

list

In [107]:
desired_df1 = my_iris.iloc[desired_index,]

In [108]:
desired_df1

     sepal_length  sepal_width  petal_length  petal_width          species
50            7.0          3.2           4.7          1.4  Iris-versicolor
51            6.4          3.2           4.5          1.5  Iris-versicolor
52            6.9          3.1           4.9          1.5  Iris-versicolor
54            6.5          2.8           4.6          1.5  Iris-versicolor
56            6.3          3.3           4.7          1.6  Iris-versicolor
..            ...          ...           ...          ...              ...
145           6.7          3.0           5.2          2.3   Iris-virginica
146           6.3          2.5           5.0          1.9   Iris-virginica
147           6.5          3.0           5.2          2.0   Iris-virginica
148           6.2          3.4           5.4          2.3   Iris-virginica
149           5.9          3.0           5.1          1.8   Iris-virginica

[70 rows x 5 columns]

In [101]:
type(desired_df1)

pandas.core.frame.DataFrame

In [102]:
desired_df1.shape

(70, 5)

In [103]:
desired_df1

     sepal_length  sepal_width  petal_length  petal_width          species
50            7.0          3.2           4.7          1.4  Iris-versicolor
51            6.4          3.2           4.5          1.5  Iris-versicolor
52            6.9          3.1           4.9          1.5  Iris-versicolor
54            6.5          2.8           4.6          1.5  Iris-versicolor
56            6.3          3.3           4.7          1.6  Iris-versicolor
..            ...          ...           ...          ...              ...
145           6.7          3.0           5.2          2.3   Iris-virginica
146           6.3          2.5           5.0          1.9   Iris-virginica
147           6.5          3.0           5.2          2.0   Iris-virginica
148           6.2          3.4           5.4          2.3   Iris-virginica
149           5.9          3.0           5.1          1.8   Iris-virginica

[70 rows x 5 columns]

In [104]:
# getting the specific columns
desired_df1[['sepal_length','sepal_width','petal_width']].head(6)

    sepal_length  sepal_width  petal_width
50           7.0          3.2          1.4
51           6.4          3.2          1.5
52           6.9          3.1          1.5
54           6.5          2.8          1.5
56           6.3          3.3          1.6
58           6.6          2.9          1.3

In [105]:
# accessing the dataframe with pure iloc values
desired_df1.iloc[0:10,0:]

    sepal_length  sepal_width  petal_length  petal_width          species
50           7.0          3.2           4.7          1.4  Iris-versicolor
51           6.4          3.2           4.5          1.5  Iris-versicolor
52           6.9          3.1           4.9          1.5  Iris-versicolor
54           6.5          2.8           4.6          1.5  Iris-versicolor
56           6.3          3.3           4.7          1.6  Iris-versicolor
58           6.6          2.9           4.6          1.3  Iris-versicolor
61           5.9          3.0           4.2          1.5  Iris-versicolor
62           6.0          2.2           4.0          1.0  Iris-versicolor
63           6.1          2.9           4.7          1.4  Iris-versicolor
65           6.7          3.1           4.4          1.4  Iris-versicolor

In [106]:
# getting total number of Iris-versicolor species from the dataframe
my_versicolor = list(my_iris.index[my_iris.species=='Iris-versicolor'])

In [107]:
len(my_versicolor)

50

In [108]:
# This will give the row only with respect to loc value
# means, without using comma "," we will get the full row using loc
my_iris.loc[0]

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
species         Iris-setosa
Name: 0, dtype: object

In [109]:
my_iris.iloc[0]

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
species         Iris-setosa
Name: 0, dtype: object

In [110]:
my_iris.iloc[0:,4]

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: species, Length: 150, dtype: object

In [111]:
my_iris.shape

(150, 5)

In [112]:
# within the shape attribute, 0th index refers to rows 
my_iris.shape[0]

150

In [113]:
# within the shape attribute, 1 index will refers to columns
my_iris.shape[1]

5

In [114]:
# last row will get printed
# we can create the generalized function for getting the last row
 # no matter what dataframe is ....
my_iris.loc[my_iris.shape[0]-1]

sepal_length               5.9
sepal_width                  3
petal_length               5.1
petal_width                1.8
species         Iris-virginica
Name: 149, dtype: object

In [115]:
# getting the seperate columns
my_iris.loc[[5,7,9]]

   sepal_length  sepal_width  petal_length  petal_width      species
5           5.4          3.9           1.7          0.4  Iris-setosa
7           5.0          3.4           1.5          0.2  Iris-setosa
9           4.9          3.1           1.5          0.1  Iris-setosa

In [116]:
# grouping the data on the basis of values
grp_my_iris = my_iris.groupby('species')

In [117]:
grp_my_iris

In [118]:
grp_my_iris['sepal_length'].mean()

species
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: sepal_length, dtype: float64

In [119]:
needed_df2=my_iris.iloc[my_versicolor,]

In [120]:
needed_df2

    sepal_length  sepal_width  petal_length  petal_width          species
50           7.0          3.2           4.7          1.4  Iris-versicolor
51           6.4          3.2           4.5          1.5  Iris-versicolor
52           6.9          3.1           4.9          1.5  Iris-versicolor
53           5.5          2.3           4.0          1.3  Iris-versicolor
54           6.5          2.8           4.6          1.5  Iris-versicolor
55           5.7          2.8           4.5          1.3  Iris-versicolor
56           6.3          3.3           4.7          1.6  Iris-versicolor
57           4.9          2.4           3.3          1.0  Iris-versicolor
58           6.6          2.9           4.6          1.3  Iris-versicolor
59           5.2          2.7           3.9          1.4  Iris-versicolor
60           5.0          2.0           3.5          1.0  Iris-versicolor
61           5.9          3.0           4.2          1.5  Iris-versicolor
62           6.0          2.2           4.0          1.0  Iris-versicolor
63           6.1          2.9           4.7          1.4  Iris-versicolor
64           5.6          2.9           3.6          1.3  Iris-versicolor
65           6.7          3.1           4.4          1.4  Iris-versicolor
66           5.6          3.0           4.5          1.5  Iris-versicolor
67           5.8          2.7           4.1          1.0  Iris-versicolor
68           6.2          2.2           4.5          1.5  Iris-versicolor
69           5.6          2.5           3.9          1.1  Iris-versicolor
70           5.9          3.2           4.8          1.8  Iris-versicolor
71           6.1          2.8           4.0          1.3  Iris-versicolor
72           6.3          2.5           4.9          1.5  Iris-versicolor
73           6.1          2.8           4.7          1.2  Iris-versicolor
74           6.4          2.9           4.3          1.3  Iris-versicolor
75           6.6          3.0           4.4          1.4  Iris-versicolor
76           6.8          2.8           4.8          1.4  Iris-versicolor
77           6.7          3.0           5.0          1.7  Iris-versicolor
78           6.0          2.9           4.5          1.5  Iris-versicolor
79           5.7          2.6           3.5          1.0  Iris-versicolor
80           5.5          2.4           3.8          1.1  Iris-versicolor
81           5.5          2.4           3.7          1.0  Iris-versicolor
82           5.8          2.7           3.9          1.2  Iris-versicolor
83           6.0          2.7           5.1          1.6  Iris-versicolor
84           5.4          3.0           4.5          1.5  Iris-versicolor
85           6.0          3.4           4.5          1.6  Iris-versicolor
86           6.7          3.1           4.7          1.5  Iris-versicolor
87           6.3          2.3           4.4          1.3  Iris-versicolor
88           5.6          3.0           4.1          1.3  Iris-versicolor
89           5.5          2.5           4.0          1.3  Iris-versicolor
90           5.5          2.6           4.4          1.2  Iris-versicolor
91           6.1          3.0           4.6          1.4  Iris-versicolor
92           5.8          2.6           4.0          1.2  Iris-versicolor
93           5.0          2.3           3.3          1.0  Iris-versicolor
94           5.6          2.7           4.2          1.3  Iris-versicolor
95           5.7          3.0           4.2          1.2  Iris-versicolor
96           5.7          2.9           4.2          1.3  Iris-versicolor
97           6.2          2.9           4.3          1.3  Iris-versicolor
98           5.1          2.5           3.0          1.1  Iris-versicolor
99           5.7          2.8           4.1          1.3  Iris-versicolor

In [121]:
np.mean(needed_df2.sepal_length)

5.936

In [122]:
student1 = pd.Series(['abhay','nitika'],index = ['a','b'])

In [123]:
student1

a     abhay
b    nitika
dtype: object

In [124]:
student2 = pd.Series(['rishabh','avni'],index = ['c','d'])

In [125]:
stu_df1 = pd.DataFrame({'name':student1})
stu_df2 = pd.DataFrame({'name':student2})

In [126]:
stu_df1

     name
a   abhay
b  nitika

In [127]:
stu_df2

      name
c  rishabh
d     avni

In [128]:
# concat function of pandas 
# This is used for concating the multiple dagtaframes
combo_df1 = pd.concat([stu_df1,stu_df2])

In [129]:
combo_df1

      name
a    abhay
b   nitika
c  rishabh
d     avni

In [130]:
# we can save our dataframe as csv also
combo_df1.to_csv('students.csv')

In [131]:
ls

 Volume in drive G is New Volume
 Volume Serial Number is 64BE-FBF7

 Directory of G:\Data_Science\My_KOENIG_Material\Machine Learning (Data Science) with Python\Chapter_1

08/07/2021  12:18 AM    <DIR>          .
08/07/2021  12:18 AM    <DIR>          ..
01/20/2021  10:41 AM    <DIR>          .ipynb_checkpoints
04/22/2019  01:23 PM            23,777 adjusted_diabetes.csv
07/09/2019  11:32 AM            46,442 bill_authentication.csv
01/20/2021  01:41 PM           226,604 Classifying_iris_data.ipynb
01/18/2021  02:36 PM               823 demo1.ipynb
04/06/2020  12:43 PM            36,323 gdp_per_capita.csv
04/03/2019  11:42 AM             4,617 IRIS.csv
08/06/2021  03:46 PM         2,637,346 Machine_Learning_Chapter1.pptx
01/19/2021  12:26 PM           381,385 my_matplotlib_1.ipynb
08/07/2021  12:18 AM            82,482 numpy_1.ipynb
04/06/2020  12:43 PM           405,467 oecd_bli_2015.csv
01/18/2021  05:07 PM           141,861 pandas_1.ipynb
07/09/2019  11:36 AM             1,389 petrol_consumption.csv
06/20/2017  07:23 AM            37,791 Pokemon.csv
01/20/2021  11:22 AM           444,556 seaborn_1.ipynb
04/07/2020  12:44 AM                58 student1.csv
08/07/2021  12:19 AM                45 students.csv
04/03/2019  10:15 AM               423 tennis.csv
04/14/2020  03:16 PM            14,457 training_running_linear_model_example_1.1.ipynb
              18 File(s)      4,485,846 bytes
               3 Dir(s)   3,931,054,080 bytes free

In [132]:
# Now, we will perform the merging of two dataframes
# define 2 dataframe in which there must be some matching values 
 # some column of two dataframes
stu_df1

     name
a   abhay
b  nitika

In [133]:
stu_df2

      name
c  rishabh
d     avni

In [134]:
stu_df1['stu_id'] = [1,2]

In [135]:
stu_df1

     name  stu_id
a   abhay       1
b  nitika       2

In [136]:
stu_df2['stu2_id'] = [2,4]

In [137]:
stu_df2

      name  stu2_id
c  rishabh        2
d     avni        4

In [138]:
merged_df12 = stu_df1.merge(stu_df2,left_on='stu_id', right_on='stu2_id')

In [139]:
merged_df12

   name_x  stu_id   name_y  stu2_id
0  nitika       2  rishabh        2

In [140]:
# Working with NaN values
from numpy import NaN,NAN,nan

In [141]:
NaN == True

False

In [142]:
NaN == False

False

In [143]:
pd.isnull(NaN)

True

In [144]:
stu_df1

     name  stu_id
a   abhay       1
b  nitika       2

In [145]:
stu_df1['interest'] = ['basketball',np.nan]

In [146]:
stu_df1

     name  stu_id    interest
a   abhay       1  basketball
b  nitika       2         NaN

In [147]:
pwd()

'G:\\Data_Science\\My_KOENIG_Material\\Machine Learning (Data Science) with Python\\Chapter_1'

In [148]:
stu_df1.to_csv('student1.csv')

In [149]:
student_df1 = pd.read_csv('student1.csv')

In [150]:
student_df1

  Unnamed: 0    name  stu_id    interest
0          a   abhay       1  basketball
1          b  nitika       2         NaN

In [151]:
student_df1

  Unnamed: 0    name  stu_id    interest
0          a   abhay       1  basketball
1          b  nitika       2         NaN

In [152]:
type(student_df1)

pandas.core.frame.DataFrame

In [153]:
student_df1['interest'].fillna(value = 'some game',axis = 0,inplace = True)

In [154]:
student_df1

  Unnamed: 0    name  stu_id    interest
0          a   abhay       1  basketball
1          b  nitika       2   some game